/**
 * 数据结构：二叉树、二叉搜索树
 *
 * 题型：
 * 二叉树的遍历
 *    94.二叉树的中序遍历
 *    144.二叉树的前序遍历
 *    145.二叉树的后序遍历
 *
 *    102.二叉树的层序遍历（自顶向下）
 *    107.二叉树的层序遍历II（自底向上）
 *    199.二叉树的层序遍历（右视图）
 *    513.二叉树的左下角的值（左视图）
 *    637.二叉树的每层平均值
 *    404.二叉树的左叶子之和
 *    515.二叉树每层的最大值
 *    429.N叉树的层序遍历
 *    116.填充每个节点的下一个右侧节点指针
 *
 *    112.二叉树的路径总和
 *    113.二叉树的路径总和II
 *
 * 二叉树的操作
 *   100.相同二叉树
 *   101.对称二叉树
 *   226.翻转二叉树
 *   617.合并二叉树
 *
 * 二叉树的属性
 *   111.二叉树的最小深度
 *   104.二叉树的最大深度
 *   235.二叉树的最近祖先
 *   543.二叉树的直径
 */
