/**
 * 66.数字加一
 *
 * 描述：给定一个非空数组，在该数组的基础上加一，遇到进位需要补0
 *
 * 示例：
 * 输入：nums = [1,2,3]
 * 输出：[1,2,4]
 *
 * 输入：nums = [9,9]
 * 输出：[1,0,0]
 *
 * 输入：nums = [4,9,9]
 * 输出：[5,0,0]
 */

/**
 * 可以分为三种情况
 * 从数组末尾开始遍历，首先判断是否需要进位，num %= 10 === 0 需要进位
 * 情况一不需要进位 [1,2,3] 先加一 [1,2,4] 4%=10 !== 0 不需要进位直接返回 nums
 * 情况二需要进位[9,9] 先加一[9,10] 10%=10 === 0 所以进位 10%=10 === 0 再进位
 */
const plusOne = function (nums) {
  const len = nums.length;

  for (let i = len - 1; i >= 0; i--) {
    nums[i] += 1;
    nums[i] %= 10;
    // [4,9,0]
    // [4,0,0]
    // [5,0,0]
    if (nums[i] !== 0) {
      return nums;
    }
  }

  nums = [...Array(len + 1)].map((num) => 0);
  nums[0] = 1;

  return nums;
};
