/**
 * LeetCode 题目分类
 * - 复杂度分析
 *   1.两数之和（需求匹配）
 *
 * - 数组
 *   26.删除数组中的重复项（快慢双指针）
 *   27.移除元素（单指针移动）
 *   35.搜索插入位置（二分查找）
 *   209.最小长度子数组（双指针，滑动窗口改变宽度）
 *   219.存在重复元素（暴力解法嵌套循环）
 *   283.移动零（左右双指针，交换位置）
 *   344.反转字符串（左右双指针，比较大小交换位置）
 *   977.有序数组的平方（左右双指针，比较赋值）
 *   1748.唯一元素的和（哈希表存储记录状态，查看或设置）
 *
 * - 链表
 *   19.删除链表的倒数第N个节点
 *   21.合并两个有序链表
 *   83.删除链表中重复的元素（遍历链表，判断删除）
 *   92.反转链表II
 *   141.环形链表（设置缓存集合，遍历查找）
 *   142.环形链表II
 *   160.相交链表
 *   203.移除链表指定元素（设置哨兵节点，遍历查找）
 *   206.反转链表
 *   234.回文链表
 *   876.链表的中间节点
 *
 * - 位运算
 *   136.只出现一次的数字
 *
 * - 树
 *
 * - 动态规划
 *
 * - 贪心
 *
 * - 队列
 *   146.LRU缓存（存在先删除再重新进入，不存在先进先出）
 */
